# Colorado cannabis data

In this notebook, we're going to look at some county-level data on retail and medical cannabis sales in Colorado. [The data are](https://www.colorado.gov/pacific/revenue/colorado-marijuana-sales-reports) updated every month by the Colorado Department of Revenue.

The cannabis sales data lives here: `../data/co-cannabis-sales.csv`.

A few things to note about this data:

- Every row in our data is the sum of one month of sales for one category of cannabis ("retail" or "medical") for one county
- Not every county in Colorado has pot shops
- Not every county in Colorado has _retail_ pot shops
- To maintain taxpayer privacy, the state releases aggregate sales data only for counties with at least three dispensaries, and then only if none represent more than 80 percent of total sales, according to the Colorado Department of Revenue. Totals for counties that don't meet these criteria are represented in the data as 'NR'
- One of the "counties" in the data is "Sum of NR Counties" -- the weed sales from all of the "NR" counties grouped together for that month -- which is how everything totals like it should

We also have a CSV of Colorado county population estimates for 2016: `../data/co-county-pop.csv`. We'll use this to help us answer a question about per-capita sales.

Let's load up our data.

First, we'll import pandas. Then we'll tell pandas to change the way it displays floating-point numbers (decimals, basically) so that we won't have to look at big numbers in scientific notation later on (gross, no thanks).

Then we'll use the `read_csv()` method to create dataframes for each CSV as we need them.

In [6]:
import pandas as pd

In [21]:
# display floats with thousand-separator commas and no decimal points
pd.options.display.float_format = '{:,.2f}'.format

In [22]:
# dataframe from the sales CSV
df_sales = pd.read_csv('../data/co-cannabis-sales.csv')

In [23]:
# use `head()` to check the output
df_sales.head()

   month  year    county       amount sales_type
0      4  2016     Adams   387,146.00    medical
1      4  2016     Adams 3,187,313.00     retail
2      4  2016   Alamosa          nan    medical
3      4  2016  Arapahoe 7,531,661.00     retail
4      4  2016  Arapahoe 1,682,301.00    medical

### Noodling

Let's check out the unique values in the columns, run some summary stats, check out samples, etc.

In [10]:
# check month values
# https://docs.python.org/3/howto/sorting.html#sorting-basics
sorted(df_sales.month.unique())

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

In [11]:
# check year values
sorted(df_sales.year.unique())

[2014, 2015, 2016, 2017, 2018]

In [12]:
# check county values
sorted(df_sales.county.unique())

['Adams',
 'Alamosa',
 'Arapahoe',
 'Archuleta',
 'Boulder',
 'Chaffee',
 'Clear Creek',
 'Conejos',
 'Costilla',
 'Denver',
 'Eagle',
 'El Paso',
 'Fremont',
 'Garfield',
 'Gilpin',
 'Grand',
 'Gunnison',
 'Huerfano',
 'Jefferson',
 'La Plata',
 'Lake',
 'Larimer',
 'Las Animas',
 'Mesa',
 'Moffat',
 'Montezuma',
 'Montrose',
 'Morgan',
 'Otero',
 'Ouray',
 'Park',
 'Pitkin',
 'Pueblo',
 'Routt',
 'Saguache',
 'San Juan',
 'San Miguel',
 'Sedgwick',
 'Sum of NR Counties',
 'Summit',
 'Teller',
 'Weld']

In [13]:
# check type values
df_sales.sales_type.unique()

array(['medical', 'retail'], dtype=object)

In [25]:
# grab a sample
df_sales.sample()

      month  year county     amount sales_type
3082      3  2018  Adams 455,735.00    medical

### Analysis

Let's answer some questions:

- Total sales for all years?
- Totals by year?
- Totals by county by year?
- Percent difference from 2014-2017, by county?
- Top counties in terms of per-capita retail sales for 2017? ([Checking this guy's work, basically](https://www.thecannabist.co/2018/02/09/colorado-marijuana-sales-southern-border/98669/).)

#### Total sales, all years

This one's pretty simple: Use `sum()`.

In [26]:
# sum the values in the `amount` column
df_sales.amount.sum()

4952920024.0

In [27]:
# peep a formatted version
'${:,}'.format(df_sales.amount.sum())

'$4,952,920,024.0'

#### Totals by year

For this, we'll select the two columns we're interested in ('year' and 'amount') and then use `groupby()` and `sum()`.

ðŸ‘‰ For more details on grouping data in pandas, [check out this notebook](../reference/Grouping%20data%20in%20pandas.ipynb).

In [29]:
# select year, amount and groupby year, sum values
df_sales[['year', 'amount']].groupby('year').sum()

               amount
year
2014   683,523,739.00
2015   995,591,255.00
2016 1,307,203,473.00
2017 1,502,047,770.00
2018   464,553,787.00

#### Totals by county and year

For this one, we'll need a pivot table. We're going to hand the [`pd.pivot_table()`](https://pandas.pydata.org/pandas-docs/version/0.22/generated/pandas.pivot_table.html) method five arguments:
- `df_sales`: The dataframe we're pivoting
- `index='county'`: The grouping column that will become the rows in our pivot table
- `values='amount'`: The column we're doing math on
- `aggfunc='sum'`: What aggregate function to apply to the values -- in this case, we want a sum
- `columns='year'`: The second grouping column that will become the columns in our pivot table

We'll fill null values with zeroes using the [`fillna()`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.fillna.html) method. We're also going to save this one to a variable, `by_county_by_year`, because we'll use the pivot table to help us answer our next question.

In [121]:
by_county_by_year = pd.pivot_table(df_sales,
                                   index='county',
                                   values='amount',
                                   aggfunc='sum',
                                   columns='year').fillna(0)

by_county_by_year

year,2014,2015,2016,2017,2018
county,,,,,
Adams,"8,531,797.00","24,826,654.00","49,810,527.00","73,319,607.00","27,478,375.00"
Alamosa,0.00,0.00,0.00,0.00,0.00
Arapahoe,"19,083,212.00","68,533,185.00","113,890,135.00","124,313,953.00","40,809,345.00"
Archuleta,0.00,0.00,0.00,"6,397,396.00","2,480,149.00"
Boulder,"62,935,522.00","82,465,474.00","95,408,126.00","99,923,326.00","32,773,801.00"
Chaffee,"438,160.00","2,067,869.00","3,492,699.00","5,422,335.00","1,568,406.00"
Clear Creek,"6,095,765.00","6,435,080.00","7,414,079.00","7,262,477.00","2,476,363.00"
Conejos,0.00,0.00,"3,522,183.00","5,426,288.00","1,692,669.00"
Costilla,0.00,0.00,"2,836,421.00","3,874,954.00","1,128,973.00"
Denver,"325,930,878.00","407,204,194.00","501,611,664.00","577,537,470.00","174,122,129.00"
Eagle,"4,494,510.00","11,685,385.00","14,839,943.00","15,510,137.00","6,723,267.00"
El Paso,"67,026,306.00","86,100,007.00","101,137,059.00","102,115,436.00","31,139,689.00"
Fremont,"2,530,928.00","2,392,649.00","2,077,835.00","1,663,232.00","531,261.00"
Garfield,"8,744,520.00","14,035,557.00","20,923,125.00","25,399,951.00","6,912,394.00"
Gilpin,"1,747,910.00","2,014,746.00","2,654,538.00","2,553,596.00","764,965.00"
Grand,0.00,"1,380,291.00","3,292,625.00","3,957,091.00","1,261,007.00"
Gunnison,"1,454,681.00","3,262,218.00","5,421,591.00","6,880,647.00","1,557,183.00"
Huerfano,0.00,0.00,0.00,0.00,0.00
Jefferson,"41,063,757.00","54,332,131.00","65,614,236.00","68,443,885.00","21,003,295.00"
La Plata,"8,212,502.00","21,593,046.00","27,020,459.00","27,798,516.00","8,476,673.00"
Lake,0.00,0.00,"1,559,663.00","2,521,582.00","859,746.00"
Larimer,"22,378,764.00","44,559,155.00","60,127,853.00","72,260,207.00","25,720,306.00"
Las Animas,0.00,"8,598,642.00","21,456,457.00","44,252,628.00","15,549,368.00"
Mesa,0.00,0.00,0.00,"3,965,601.00","5,267,445.00"
Moffat,0.00,0.00,0.00,0.00,0.00
Montezuma,"1,045,648.00","6,528,779.00","13,110,536.00","20,988,379.00","7,309,622.00"
Montrose,0.00,0.00,0.00,0.00,0.00
Morgan,0.00,0.00,"4,138,315.00","7,918,703.00","2,633,517.00"
Otero,0.00,0.00,0.00,0.00,0.00
Ouray,0.00,"342,064.00","2,877,027.00","3,916,922.00","846,370.00"
Park,0.00,"1,815,652.00","3,331,577.00","4,250,202.00","1,351,164.00"
Pitkin,"4,540,654.00","8,702,783.00","10,628,750.00","12,299,200.00","4,971,809.00"
Pueblo,"19,643,161.00","25,943,197.00","40,905,704.00","47,385,855.00","18,444,802.00"
Routt,"2,010,323.00","7,375,897.00","10,531,432.00","10,807,633.00","4,806,384.00"
Saguache,0.00,0.00,0.00,"464,254.00","472,320.00"
San Juan,0.00,0.00,0.00,0.00,0.00
San Miguel,"4,933,578.00","3,868,704.00","3,769,099.00","4,528,036.00","1,636,737.00"
Sedgwick,0.00,0.00,0.00,0.00,0.00
Sum of NR Counties,"42,852,740.00","57,468,800.00","61,876,897.00","49,691,165.00","2,211,251.00"
Summit,"13,510,892.00","17,722,280.00","21,872,338.00","24,259,822.00","5,850,103.00"
Teller,0.00,0.00,0.00,0.00,0.00
Weld,"14,317,531.00","24,336,816.00","30,050,580.00","34,737,284.00","3,722,899.00"

### Percent difference from 2014-2017, by county

So we're just going to build on the pivot table we just made by adding a calculated column.

First, though, we need to use [`reset_index()`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.reset_index.html) to change the data structure from a pivot table with multiple levels to a plain old dataframe. Finally, we'll change the name of the indexed columns from `'year'` to `''`.

In [122]:
bcby_with_pct_change = by_county_by_year.reset_index()
bcby_with_pct_change.columns.name = ''

Now we can calculate the percent change over time. The formula is:

```
(new value - old value)
-----------------------    *   100
       old value
```

Then sort descending by our new value, and voilÃ¡!

In [124]:
bcby_with_pct_change['change14-17'] = ((bcby_with_pct_change[2017] - bcby_with_pct_change[2014]) / bcby_with_pct_change[2014]) * 100

bcby_with_pct_change.sort_values('change14-17', ascending=False)

,county,2014,2015,2016,2017,2018,change14-17
15,Grand,0.00,"1,380,291.00","3,292,625.00","3,957,091.00","1,261,007.00",inf
3,Archuleta,0.00,0.00,0.00,"6,397,396.00","2,480,149.00",inf
34,Saguache,0.00,0.00,0.00,"464,254.00","472,320.00",inf
22,Las Animas,0.00,"8,598,642.00","21,456,457.00","44,252,628.00","15,549,368.00",inf
7,Conejos,0.00,0.00,"3,522,183.00","5,426,288.00","1,692,669.00",inf
8,Costilla,0.00,0.00,"2,836,421.00","3,874,954.00","1,128,973.00",inf
30,Park,0.00,"1,815,652.00","3,331,577.00","4,250,202.00","1,351,164.00",inf
20,Lake,0.00,0.00,"1,559,663.00","2,521,582.00","859,746.00",inf
29,Ouray,0.00,"342,064.00","2,877,027.00","3,916,922.00","846,370.00",inf
27,Morgan,0.00,0.00,"4,138,315.00","7,918,703.00","2,633,517.00",inf
23,Mesa,0.00,0.00,0.00,"3,965,601.00","5,267,445.00",inf
25,Montezuma,"1,045,648.00","6,528,779.00","13,110,536.00","20,988,379.00","7,309,622.00","1,907.21"
5,Chaffee,"438,160.00","2,067,869.00","3,492,699.00","5,422,335.00","1,568,406.00","1,137.52"
0,Adams,"8,531,797.00","24,826,654.00","49,810,527.00","73,319,607.00","27,478,375.00",759.37
2,Arapahoe,"19,083,212.00","68,533,185.00","113,890,135.00","124,313,953.00","40,809,345.00",551.43
33,Routt,"2,010,323.00","7,375,897.00","10,531,432.00","10,807,633.00","4,806,384.00",437.61
16,Gunnison,"1,454,681.00","3,262,218.00","5,421,591.00","6,880,647.00","1,557,183.00",373.00
10,Eagle,"4,494,510.00","11,685,385.00","14,839,943.00","15,510,137.00","6,723,267.00",245.09
19,La Plata,"8,212,502.00","21,593,046.00","27,020,459.00","27,798,516.00","8,476,673.00",238.49
21,Larimer,"22,378,764.00","44,559,155.00","60,127,853.00","72,260,207.00","25,720,306.00",222.90
13,Garfield,"8,744,520.00","14,035,557.00","20,923,125.00","25,399,951.00","6,912,394.00",190.47
31,Pitkin,"4,540,654.00","8,702,783.00","10,628,750.00","12,299,200.00","4,971,809.00",170.87
41,Weld,"14,317,531.00","24,336,816.00","30,050,580.00","34,737,284.00","3,722,899.00",142.62
32,Pueblo,"19,643,161.00","25,943,197.00","40,905,704.00","47,385,855.00","18,444,802.00",141.23
39,Summit,"13,510,892.00","17,722,280.00","21,872,338.00","24,259,822.00","5,850,103.00",79.56
9,Denver,"325,930,878.00","407,204,194.00","501,611,664.00","577,537,470.00","174,122,129.00",77.20
18,Jefferson,"41,063,757.00","54,332,131.00","65,614,236.00","68,443,885.00","21,003,295.00",66.68
4,Boulder,"62,935,522.00","82,465,474.00","95,408,126.00","99,923,326.00","32,773,801.00",58.77
11,El Paso,"67,026,306.00","86,100,007.00","101,137,059.00","102,115,436.00","31,139,689.00",52.35
14,Gilpin,"1,747,910.00","2,014,746.00","2,654,538.00","2,553,596.00","764,965.00",46.09
6,Clear Creek,"6,095,765.00","6,435,080.00","7,414,079.00","7,262,477.00","2,476,363.00",19.14
38,Sum of NR Counties,"42,852,740.00","57,468,800.00","61,876,897.00","49,691,165.00","2,211,251.00",15.96
36,San Miguel,"4,933,578.00","3,868,704.00","3,769,099.00","4,528,036.00","1,636,737.00",-8.22
12,Fremont,"2,530,928.00","2,392,649.00","2,077,835.00","1,663,232.00","531,261.00",-34.28
1,Alamosa,0.00,0.00,0.00,0.00,0.00,nan
17,Huerfano,0.00,0.00,0.00,0.00,0.00,nan
24,Moffat,0.00,0.00,0.00,0.00,0.00,nan
26,Montrose,0.00,0.00,0.00,0.00,0.00,nan
28,Otero,0.00,0.00,0.00,0.00,0.00,nan
35,San Juan,0.00,0.00,0.00,0.00,0.00,nan
37,Sedgwick,0.00,0.00,0.00,0.00,0.00,nan
40,Teller,0.00,0.00,0.00,0.00,0.00,nan

### Top counties, per-capita retail sales, 2017

To answer this one, we'll first need to join the cannabis sales data to the population data. Let's do that now.

First, read in the population CSV. We're going to specify that the FIPS code is a string, not a number, with the `dtype` argument.

In [126]:
# read in the pop data, specify fips column is a string
df_pop = pd.read_csv('../data/co-county-pop.csv', dtype={'fips': str})

In [127]:
# check the output with `head()`
df_pop.head()

    fips county_name  pop_2016
0  08001       Adams    498187
1  08003     Alamosa     16654
2  08005    Arapahoe    637068
3  08007   Archuleta     12854
4  08009        Baca      3568

Now we need to isolate the sales data we're interested in: retail sales from 2017. I like to do this in two steps. First, filter to get retail sales. Then filter to get 2017 sales.

In [128]:
# filter for 'retail' sales
retail = df_sales[df_sales.sales_type == 'retail']

In [129]:
# check the output with `head()`
retail.head()

   month  year     county       amount sales_type
1      4  2016      Adams 3,187,313.00     retail
3      4  2016   Arapahoe 7,531,661.00     retail
5      4  2016  Archuleta          nan     retail
7      4  2016    Boulder 5,082,136.00     retail
9      4  2016    Chaffee   300,638.00     retail

In [130]:
# filter that for 2017 sales
retail_2017 = retail[retail.year == 2017]

In [131]:
# check the output with `head()`
retail_2017.head()

      month  year     county       amount sales_type
1436      7  2017      Adams 5,462,382.00     retail
1438      7  2017   Arapahoe 9,672,770.00     retail
1440      7  2017  Archuleta   884,084.00     retail
1442      7  2017    Boulder 7,070,534.00     retail
1444      7  2017    Chaffee   662,413.00     retail

Excellent! Each row in this dataframe is a month's worth of sales, but we want to get the annual total. So we want to select the `county` and `amount` columns, group by `county` and `sum()` the amount:

In [132]:
retail_17_grouped = retail_2017[['county', 'amount']].groupby('county').sum()

In [133]:
# check the output with `head()`
retail_17_grouped.head()

                  amount
county
Adams      62,132,216.00
Arapahoe  111,836,427.00
Archuleta   6,397,396.00
Boulder    77,438,466.00
Chaffee     5,422,335.00

Perf. Now we'll join the two dataframes using the `merge()` function. (Note: Every county is represented in the population data, but not every county is present in the weed sales data.)

ðŸ‘‰ For more details on merging data in pandas, [see this notebook](../reference/Merging%20data%20in%20pandas.ipynb).

In [134]:
merged = pd.merge(retail_17_grouped,
                  df_pop,
                  left_on='county',
                  right_on='county_name',
                  how='left')

In [135]:
# check the output with `head()`
merged.head()

          amount   fips county_name   pop_2016
0  62,132,216.00  08001       Adams 498,187.00
1 111,836,427.00  08005    Arapahoe 637,068.00
2   6,397,396.00  08007   Archuleta  12,854.00
3  77,438,466.00  08013     Boulder 322,226.00
4   5,422,335.00  08015     Chaffee  19,058.00

Now we can calculate the per-capita sales by dividing the amount into the population:

In [136]:
merged['per_capita'] = merged['amount'] / merged['pop_2016']

In [137]:
# `sort_values()` on per_capita column and check the output with `head()`
merged.sort_values('per_capita', ascending=False).head()

          amount   fips county_name  pop_2016  per_capita
20 43,913,648.00  08071  Las Animas 14,103.00    3,113.78
7   3,874,954.00  08023    Costilla  3,721.00    1,041.37
24  3,916,922.00  08091       Ouray  4,857.00      806.45
34 22,904,938.00  08117      Summit 30,374.00      754.10
22 20,163,593.00  08083   Montezuma 26,999.00      746.83

Los Animas! Looks like the dude's numbers check out.